# """
# Дано рядок. Виконайте наступні дії із рядком:
# """
# symbols = 'abcdefghijklmnopqrstuvwxyz'
# print(symbols)
# print(f"len({symbols})={len(symbols)}")
# #1) Спочатку виведіть третій символ цього рядка.
# print(symbols[2]) # 'c'
# #2) У другому рядку виведіть передостанній символ цього рядка.
# #str[start:end:step]
# print(symbols[-2]) # 'y'
# length=len(symbols)
# print(symbols[length-2]) # 'y'
# #3) У третьому рядку виведіть перші п'ять символів цього рядка.
# print(symbols[:5])
# print(symbols[-length:-length+5])  #-26 :-21
# #4) У четвертому рядку виведіть весь рядок, крім останніх двох символів.
# print(symbols[:-2])
# #5) У п'ятому рядку виведіть всі символи з парними індексами (вважаючи, що індексація починається з 0, тому символи виводяться починаючи з першого).
# print(symbols[1::2])
# #6) У шостому рядку виведіть всі символи з непарними індексами, тобто починаючи з другого символу рядка.
# print(symbols[::2])
# #7) У сьомому рядку виведіть всі символи в зворотному порядку.
# print(symbols[::-1])  # 0 + -1 , -2, -3
# #8) У восьмому рядку виведіть всі символи рядка через один в зворотному порядку, починаючи з останнього.
# print(symbols[-1::-2])
# #9) У дев'ятому рядку виведіть довжину цього рядка.

# print("456.4".isdigit())
# print("456".isdecimal())
# print("4564.5".isalnum())

# #ex
